### Проект: Анализ вакансий из HeadHunter

Начинаем с импорта библиотек

In [2]:
import pandas as pd
import psycopg2

In [3]:
pd.__version__

'2.2.1'

In [59]:
# хороший тон при фиксации изменений в github не публиковать код с открытыми данными для входа
# для запуска кода поместите данные, которые указаны на странице курса в эту ячейку
# при размещении в github удалите эту ячейку
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

Создаем соединение с заданными параметрами

In [60]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

In [10]:
# код запроса представляет из себя строковую переменную 
# 3.1
query_3_1 = f'''select count(name)
            from vacancies
         '''
# лучше использовать f-строки - так удобнее передавать параметры

In [11]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 3.1
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\2187130260.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

In [14]:
# код запроса представляет из себя строковую переменную 
# 3.2
query_3_2 = f'''select count(id)
            from employers
         '''
# лучше использовать f-строки - так удобнее передавать параметры

In [15]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 3.2
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\92437936.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

In [16]:
# код запроса представляет из себя строковую переменную 
# 3.3
query_3_3 = f'''select count(id)
            from areas
         '''
# лучше использовать f-строки - так удобнее передавать параметры

In [17]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 3.3
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\2187136684.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

In [18]:
# код запроса представляет из себя строковую переменную 
# 3.4
query_3_4 = f'''select count(id)
            from industries
         '''
# лучше использовать f-строки - так удобнее передавать параметры

In [19]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 3.4
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3866612738.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

In [41]:
# код запроса представляет из себя строковую переменную 
# 4.1
query_4_1 = f'''select 
                    a.name as "Регион",
                    count(v.id) as "Количество вакансий"
                from areas a
                join vacancies v ON v.area_id = a.id
                group by 1
                order by 2 DESC
                limit 5
             '''
# лучше использовать f-строки - так удобнее передавать параметры

In [42]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 4.1
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3543039334.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

            Регион  Количество вакансий
0           Москва                 5333
1  Санкт-Петербург                 2851
2            Минск                 2112
3      Новосибирск                 2006
4           Алматы                 1892

In [43]:
# код запроса представляет из себя строковую переменную 
# 4.2
query_4_2 = f'''select count(vacancies.id) as "Количество вакансий"
                from vacancies
                where salary_from IS NOT NULL or salary_to IS NOT NULL
             '''
# лучше использовать f-строки - так удобнее передавать параметры

In [44]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 4.2
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\1729028985.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   Количество вакансий
0                24073

In [45]:
# код запроса представляет из себя строковую переменную 
# 4.3
query_4_3 = f'''select
                    round (avg(salary_from)) as "средние по нижней границе заработной платы",
                    round (avg(salary_to)) AS "средние по верхней границе заработной платы"
                from vacancies
             '''
# лучше использовать f-строки - так удобнее передавать параметры

In [46]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 4.3
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\451535328.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   средние по нижней границе заработ  средние по верхней границе зарабо
0                            71065.0                           110537.0

In [51]:
# код запроса представляет из себя строковую переменную 
# 4.4
query_4_4 = f'''select 
                    vacancies.schedule as "Тип рабочего графика",
                    vacancies.employment as "Тип трудоустройства",
                    count(vacancies.id) as "Количество вакансий"
                from vacancies
                group by vacancies.schedule,vacancies.employment
                order by 3 desc
                limit 2
             '''
# лучше использовать f-строки - так удобнее передавать параметры

In [52]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 4.4
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\2844389134.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

  Тип рабочего графика Тип трудоустройства  Количество вакансий
0          Полный день    Полная занятость                35367
1     Удаленная работа    Полная занятость                 7802

In [53]:
# код запроса представляет из себя строковую переменную 
# 4.5
query_4_5 = f'''select 
                    vacancies.experience as "Опыт работы",
                    count(vacancies.id) as "Количество вакансий"
                from vacancies
                group by vacancies.experience
                order by 2
                limit 4
             '''
# лучше использовать f-строки - так удобнее передавать параметры

In [54]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 4.5
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\877495041.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

          Опыт работы  Количество вакансий
0         Более 6 лет                 1337
1           Нет опыта                 7197
2       От 3 до 6 лет                14511
3  От 1 года до 3 лет                26152

Запрос

In [61]:
# код запроса представляет из себя строковую переменную 
# 5.1
query_5_1 = f'''(select 
                     employers.name as "Название работодателя",
                     count(vacancies.id) as "Количество вакансий"
                 from employers
                 join vacancies on vacancies.employer_id = employers.id
                 group by employers.name
                 order by 2 desc
                 limit 1)
                union all
                (select 
                     employers.name as "Название работодателя",
                     count(vacancies.id) as "Количество вакансий"
                 from employers
                 join vacancies on vacancies.employer_id = employers.id
                 group by employers.name
                 order by 2 desc
                 offset 4 limit 1)
            '''
# лучше использовать f-строки - так удобнее передавать параметры

In [62]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 5.1
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3760882056.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

  Название работодателя  Количество вакансий
0                Яндекс                 1933
1         Газпром нефть                  331

In [65]:
# код запроса представляет из себя строковую переменную 
# 5.2
query_5_2 = f'''select a.name "Название региона", count(distinct e.id) "Количество работодателей", count(distinct v.id) "Количество вакансий"
            from
                  areas a
                  left join employers e on a.id = e.area
                  left join vacancies v on v.area_id = a.id
            where v.id is null
            group by a.id
            order by 2 desc
            limit 1
         '''
# лучше использовать f-строки - так удобнее передавать параметры

### Выполнение запроса

In [66]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 5.2
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3261255924.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

  Название региона  Количество работодателей  Количество вакансий
0           Россия                       410                    0

In [69]:
# код запроса представляет из себя строковую переменную 
# 5.3
query_5_3 = f'''select 
                    e.name "Название работодателя",
                    count(distinct v.area_id) "Количество регионов где публикуются вакансии",
                    count(distinct v.id) "Количество вакансий"
                from employers e
                join vacancies v on v.employer_id = e.id
                group by 1
                order by 3 desc
                limit 10
             '''
# лучше использовать f-строки - так удобнее передавать параметры

In [70]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 5.3
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3033624204.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

,Название работодателя,Количество регионов где публикуют,Количество вакансий
0,Яндекс,181,1933
1,Ростелеком,152,491
2,Тинькофф,43,444
3,СБЕР,24,428
4,Газпром нефть,24,331
5,ИК СИБИНТЕК,46,327
6,МТС,55,292
7,DataArt,2,247
8,Совкомбанк Технологии,26,204
9,Первый Бит,43,176

In [71]:
# код запроса представляет из себя строковую переменную 
# 5.4
query_5_4 = f'''select count(*) cnt
                from employers e
                left join employers_industries ei on e.id = ei.employer_id
                where ei.industry_id is null
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [72]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 5.4
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\1651684398.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

    cnt
0  8419

In [75]:
# код запроса представляет из себя строковую переменную 
# 5.5
query_5_5 = f'''select count(ei.industry_id) "Количество сфер", e.name "Название работодателя"
                from employers e
                left join employers_industries ei on e.id = ei.employer_id
                group by e.id
                having count(ei.industry_id)=4
                order by 2
                offset 2 limit 1
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [76]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 5.5
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\731898222.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   Количество сфер Название работодателя
0                4                  2ГИС

In [77]:
# код запроса представляет из себя строковую переменную 
# 5.6
query_5_6 = f'''select count(ei.industry_id) "Количество сфер"
from industries i
left join employers_industries ei on i.id = ei.industry_id
group by i.id
having i.name='Разработка программного обеспечения'
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [78]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 5.6
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3363201357.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   Количество сфер
0             3553

In [138]:
# код запроса представляет из себя строковую переменную 
# 5.7
import requests
from bs4 import BeautifulSoup

url='https://ru.wikipedia.org/wiki/Города-миллионеры_России'
response=requests.get(url)
page=BeautifulSoup (response. text, 'html.parser')

cities_here=str(page.find( 'table', class_="standard"))
cities_here=cities_here.split('title="')[3:]

million_cities = []
#million_cities = tuple(million_cities) 
for i in cities_here:
    million_cities.append(i.split('">')[0])
# лучше использовать f-строки - так удобнее передавать параметры

In [184]:
# код запроса представляет из себя строковую переменную 
# 5.7
query_5_7 = f'''
WITH temp AS 
            (select a.name as name, count(v.id) as cnt
            from employers e
            join vacancies v on e.id = v.employer_id
            join areas a on a.id = v.area_id
            where e.name = 'Яндекс' and a.name in {tuple(million_cities)}
            group by a.id)
            select temp.name,
                    temp.cnt
            from temp
            union all
            select 'Total', 
                    sum(temp.cnt)  
            from temp
'''
# лучше использовать f-строки - так удобнее передавать параметры

In [185]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 5.7
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\4037940136.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name    cnt
0            Москва   54.0
1   Санкт-Петербург   42.0
2      Екатеринбург   39.0
3       Новосибирск   35.0
4         Волгоград   24.0
5           Воронеж   32.0
6         Краснодар   30.0
7        Красноярск   23.0
8   Нижний Новгород   36.0
9              Омск   21.0
10            Пермь   25.0
11   Ростов-на-Дону   25.0
12           Самара   26.0
13           Казань   25.0
14              Уфа   26.0
15        Челябинск   22.0
16            Total  485.0

In [186]:
# код запроса представляет из себя строковую переменную 
# 6.1
query_6_1 = f'''select count(*)
                from vacancies
                where name ilike '%data%' or name ilike '%данн%'
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [187]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 6.1
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\430608920.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

In [188]:
# код запроса представляет из себя строковую переменную 
# 6.2
query_6_2 = f'''select count(*)
                from vacancies
                where (lower(vacancies.name) LIKE '%data scientist%' 
                or lower(vacancies.name) LIKE '%data science%' 
                or lower(vacancies.name) LIKE '%исследователь данных%' 
                or vacancies.name LIKE '%ML%' and vacancies.name NOT LIKE '%HTML%' 
                or lower(vacancies.name) LIKE '%machine learning%' 
                or lower(vacancies.name) LIKE '%машинн%обучен%') 
                and(lower(vacancies.name) LIKE '%junior%'
                or lower(vacancies.experience)='нет опыта'
                or lower(vacancies.employment)='стажировка')
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [189]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 6.2
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\2825064127.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

In [190]:
# код запроса представляет из себя строковую переменную 
# 6.3
query_6_3 = f'''select count(*)
                from vacancies
                where (lower(vacancies.name) LIKE '%data scientist%' 
                or lower(vacancies.name) LIKE '%data science%' 
                or lower(vacancies.name) LIKE '%исследователь данных%' 
                or lower(vacancies.name) LIKE '%ml%' and vacancies.name NOT LIKE '%HTML%' and vacancies.name not like '%QML%' 
                or lower(vacancies.name) LIKE '%machine learning%' 
                or lower(vacancies.name) LIKE '%машинн%обучен%') 
                and(lower(vacancies.key_skills) LIKE '%postgres%'
                or lower(vacancies.key_skills) LIKE '%sql%')
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [191]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 6.3
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\3709805219.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    229

In [194]:
# код запроса представляет из себя строковую переменную 
# 6.4
query_6_4 = f'''select count(*)
                from vacancies
                where (lower(vacancies.name) LIKE '%data scientist%' 
                or lower(vacancies.name) LIKE '%data science%' 
                or lower(vacancies.name) LIKE '%исследователь данных%' 
                or lower(vacancies.name) LIKE '%ml%' and vacancies.name NOT LIKE '%HTML%' and vacancies.name not like '%QML%' 
                or lower(vacancies.name) LIKE '%machine learning%' 
                or lower(vacancies.name) LIKE '%машинн%обучен%') 
                and(lower(vacancies.key_skills) LIKE '%python%')
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [195]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 6.4
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\1639840439.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    357

In [214]:
# код запроса представляет из себя строковую переменную 
# 6.5
query_6_5 = f'''SELECT 
    round(avg(length(key_skills) - length(replace(key_skills, CHR(9), ''))+1), 2)
FROM vacancies
WHERE
    (lower(name) like '%data scientist%'
    or lower(name) like '%data science%'
    or lower(name) like '%исследователь данных%'
    or (name like '%ML%' and name not ilike '%HTML%')
    or lower(name) like '%machine learning%'
    or lower(name) like '%машинн%обучен%')
    and upper(name) not like '%HTML%'
    and key_skills is not null
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [215]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 6.5
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\2940343815.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

In [228]:
# код запроса представляет из себя строковую переменную 
# 6.6
query_6_6 = f'''SELECT experience, round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) as wage
FROM vacancies 
WHERE (name ilike '%data science%'
    or name ilike '%data scientist%'
    or name ilike '%machine learning%'
    or name ilike '%исследователь данных%'
    or name ilike '%машинн%обучен%'
    or (name like '%ML%' and name not like '%HTML%'))   
GROUP BY 1 
                '''
# лучше использовать f-строки - так удобнее передавать параметры

In [229]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма 
# 6.6
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\4110104214.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience      wage
0         Более 6 лет       NaN
1           Нет опыта   74643.0
2  От 1 года до 3 лет  139675.0
3       От 3 до 6 лет  243115.0

### Финал

In [57]:
# не забываем закрыть соединение после окончания работы
connection.close()